In [21]:
import pandas as pd
import numpy as np

# Create sample data
data = {
    'Age': [25, np.nan, 30, 35, np.nan],
    'Salary': [50000, 60000, np.nan, 80000, 70000],
    'Department': ['IT', 'HR', np.nan, 'IT', 'HR']
}

df = pd.DataFrame(data)

In [22]:
df

    Age   Salary Department
0  25.0  50000.0         IT
1   NaN  60000.0         HR
2  30.0      NaN        NaN
3  35.0  80000.0         IT
4   NaN  70000.0         HR

In [25]:
df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Salary'].fillna(df['Salary'].mean(), inplace=True)

df

    Age   Salary Department
0  25.0  50000.0         IT
1  30.0  60000.0         HR
2  30.0  65000.0        NaN
3  35.0  80000.0         IT
4  30.0  70000.0         HR

In [26]:
df.dropna()

    Age   Salary Department
0  25.0  50000.0         IT
1  30.0  60000.0         HR
3  35.0  80000.0         IT
4  30.0  70000.0         HR

In [28]:
data = {'Sales': [4000, 7000, 5500, 3000, 10000], 
        'Region': ['North', 'South', 'North', 'East', 'North']}
df = pd.DataFrame(data)
df

   Sales Region
0   4000  North
1   7000  South
2   5500  North
3   3000   East
4  10000  North

In [34]:
filtered_df = df[(df['Sales'] > 5000) & (df['Region'] == 'North')]
filtered_df

   Sales Region
2   5500  North
4  10000  North

In [35]:
df = pd.DataFrame({
    'Department': ['HR', 'IT', 'HR', 'IT', 'Sales'],
    'Salary': [50000, 80000, 60000, 75000, 90000]
})

In [36]:
df

  Department  Salary
0         HR   50000
1         IT   80000
2         HR   60000
3         IT   75000
4      Sales   90000

In [40]:
avg=df.groupby('Department')["Salary"].mean()
avg

Department
HR       55000.0
IT       77500.0
Sales    90000.0
Name: Salary, dtype: float64

In [46]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie'], 'Department': ['HR', 'IT', 'Finance']})
df2 = pd.DataFrame({'ID': [1, 2, 3], 'Salary': [50000, 70000, 60000]})

df1

   ID     Name Department
0   1    Alice         HR
1   2      Bob         IT
2   3  Charlie    Finance

In [47]:
df2

   ID  Salary
0   1   50000
1   2   70000
2   3   60000

In [49]:
df_merge=pd.merge(df1,df2, on='ID')
df_merge

   ID     Name Department  Salary
0   1    Alice         HR   50000
1   2      Bob         IT   70000
2   3  Charlie    Finance   60000

In [50]:
df = pd.DataFrame({'Date': ['2022-05-10', '2023-07-20', '2021-03-15']})

# Extract year from Date
df['Year'] = pd.to_datetime(df['Date']).dt.year

print(df)

         Date  Year
0  2022-05-10  2022
1  2023-07-20  2023
2  2021-03-15  2021

In [51]:
df = pd.DataFrame({'Product': ['A', 'B', 'C', 'D'],
                   'Price': [200, 150, 200, 300],
                   'Rating': [4.5, 4.7, 4.2, 4.8]})
df

  Product  Price  Rating
0       A    200     4.5
1       B    150     4.7
2       C    200     4.2
3       D    300     4.8

In [52]:
df_sorted = df.sort_values(by=['Price', 'Rating'], ascending=[False, True])
df_sorted

  Product  Price  Rating
3       D    300     4.8
2       C    200     4.2
0       A    200     4.5
1       B    150     4.7

In [55]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'Charlie'],
    'Age': [25, 30, 25, 35]
})
df

      Name  Age
0    Alice   25
1      Bob   30
2    Alice   25
3  Charlie   35

In [54]:
df.drop_duplicates()

      Name  Age
0    Alice   25
1      Bob   30
3  Charlie   35

In [58]:
df.rename(columns={'Name':'FurstName'})

  FurstName  Age
0     Alice   25
1       Bob   30
2     Alice   25
3   Charlie   35

In [59]:
df.loc[3,"Charlie"]="me"

In [60]:
df

      Name  Age Charlie
0    Alice   25     NaN
1      Bob   30     NaN
2    Alice   25     NaN
3  Charlie   35      me

In [63]:
data = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 28],
    'Salary': [50000, 60000, 70000, 80000, 55000],
    'Department': ['IT', 'HR', 'Finance', 'IT', 'HR']
}

df = pd.DataFrame(data)
df

   ID     Name  Age  Salary Department
0   1    Alice   25   50000         IT
1   2      Bob   30   60000         HR
2   3  Charlie   35   70000    Finance
3   4    David   40   80000         IT
4   5      Eva   28   55000         HR

In [64]:
#change davids salary to 90000
df.loc[df["Name"]=="David","Salary"]=90000